# Lab | Data Cleaning and Formatting

Objective: Apply Python programming to perform data cleaning and formatting, including identifying and handling with missing values, duplicates, outliers, errors, and using various formatting techniques such as changing data types, renaming columns, and handling string values, to prepare data for analysis.

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [3]:
df.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [4]:
cols2 = []
for i in range(len(df.columns)):
    cols2.append(df.columns[i].lower())
df.columns = cols2

In [5]:
df.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [25]:
df = df.rename(columns={'customer lifetime value':'customer_lifetime_value(%)', 'monthly premium auto': 'monthly_premium_auto','number of open complaints':'number_of_open_complaints','policy type':'policy_type','vehicle class':'vehicle_class','total claim amount':'total_claim_amount'})
df.head()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,female,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,female,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,male,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,male,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. For example, the gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

In [7]:
df['gender'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [8]:
df['gender'] = df['gender'].replace({'F': 'female', 'M':'male','Female':'female','Male':'male'})
df.head()

,customer,st,gender,education,customer lifetime value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,female,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,female,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,male,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,male,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [26]:
df['customer_lifetime_value(%)'].unique()

array([nan, '697953.59%', '1288743.17%', ..., '2031499.76%', '323912.47%',
       '899704.02%'], dtype=object)

In [27]:
df['customer_lifetime_value(%)'].nunique()

1027

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   customer                    1071 non-null   object
 1   st                          1071 non-null   object
 2   gender                      4008 non-null   object
 3   education                   1071 non-null   object
 4   customer_lifetime_value(%)  1068 non-null   object
 5   income                      1071 non-null   float64
 6   monthly_premium_auto        1071 non-null   float64
 7   number_of_open_complaints   1071 non-null   object
 8   policy_type                 1071 non-null   object
 9   vehicle_class               1071 non-null   object
 10  total_claim_amount          1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [29]:
df['customer_lifetime_value(%)']=df['customer_lifetime_value(%)'].str.replace('%','')
df.head()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,female,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,female,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,male,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,male,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

In [30]:
df.dtypes

customer                       object
st                             object
gender                         object
education                      object
customer_lifetime_value(%)     object
income                        float64
monthly_premium_auto          float64
number_of_open_complaints      object
policy_type                    object
vehicle_class                  object
total_claim_amount            float64
dtype: object

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   customer                    1071 non-null   object
 1   st                          1071 non-null   object
 2   gender                      4008 non-null   object
 3   education                   1071 non-null   object
 4   customer_lifetime_value(%)  1068 non-null   object
 5   income                      1071 non-null   float64
 6   monthly_premium_auto        1071 non-null   float64
 7   number_of_open_complaints   1071 non-null   object
 8   policy_type                 1071 non-null   object
 9   vehicle_class               1071 non-null   object
 10  total_claim_amount          1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [32]:
df['customer_lifetime_value(%)']=df['customer_lifetime_value(%)'].astype(float)

In [33]:
df.dtypes

customer                       object
st                             object
gender                         object
education                      object
customer_lifetime_value(%)    float64
income                        float64
monthly_premium_auto          float64
number_of_open_complaints      object
policy_type                    object
vehicle_class                  object
total_claim_amount            float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

Save the cleaned dataset to a new CSV file.

In [34]:
df.isnull()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,False,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,False,True,True,True,True,True,True,True,True
4004,True,True,False,True,True,True,True,True,True,True,True
4005,True,True,False,True,True,True,True,True,True,True,True
4006,True,True,False,True,True,True,True,True,True,True,True
4007,True,True,False,True,True,True,True,True,True,True,True

In [35]:
df.isnull().sum()

customer                      2937
st                            2937
gender                           0
education                     2937
customer_lifetime_value(%)    2940
income                        2937
monthly_premium_auto          2937
number_of_open_complaints     2937
policy_type                   2937
vehicle_class                 2937
total_claim_amount            2937
dtype: int64

In [36]:
df['gender'] = df['gender'].fillna(value = 'unknown')
df.head()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,female,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,female,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,male,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,male,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [45]:
df['customer_lifetime_value(%)'] = df['customer_lifetime_value(%)'].fillna(value = df['customer_lifetime_value(%)'].mean())
df.head()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,7.936903e+05,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,female,Bachelor,6.979536e+05,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,female,Bachelor,1.288743e+06,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,male,Bachelor,7.645862e+05,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,male,High School or Below,5.363077e+05,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [46]:
pd.set_option('display.float_format', lambda x: '%.5f' % x)
df.head()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,793690.25934,0.00000,1000.00000,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,female,Bachelor,697953.59000,0.00000,94.00000,1/0/00,Personal Auto,Four-Door Car,1131.46493
2,AI49188,Nevada,female,Bachelor,1288743.17000,48767.00000,108.00000,1/0/00,Personal Auto,Two-Door Car,566.47225
3,WW63253,California,male,Bachelor,764586.18000,0.00000,106.00000,1/0/00,Corporate Auto,SUV,529.88134
4,GA49547,Washington,male,High School or Below,536307.65000,36357.00000,68.00000,1/0/00,Personal Auto,Four-Door Car,17.26932

In [47]:
df

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,793690.25934,0.00000,1000.00000,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,female,Bachelor,697953.59000,0.00000,94.00000,1/0/00,Personal Auto,Four-Door Car,1131.46493
2,AI49188,Nevada,female,Bachelor,1288743.17000,48767.00000,108.00000,1/0/00,Personal Auto,Two-Door Car,566.47225
3,WW63253,California,male,Bachelor,764586.18000,0.00000,106.00000,1/0/00,Corporate Auto,SUV,529.88134
4,GA49547,Washington,male,High School or Below,536307.65000,36357.00000,68.00000,1/0/00,Personal Auto,Four-Door Car,17.26932
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,unknown,NaN,793690.25934,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,unknown,NaN,793690.25934,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,unknown,NaN,793690.25934,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,unknown,NaN,793690.25934,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,unknown,NaN,793690.25934,NaN,NaN,NaN,NaN,NaN,NaN

In [49]:
df = df.dropna(how='any')
df

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,793690.25934,0.00000,1000.00000,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,female,Bachelor,697953.59000,0.00000,94.00000,1/0/00,Personal Auto,Four-Door Car,1131.46493
2,AI49188,Nevada,female,Bachelor,1288743.17000,48767.00000,108.00000,1/0/00,Personal Auto,Two-Door Car,566.47225
3,WW63253,California,male,Bachelor,764586.18000,0.00000,106.00000,1/0/00,Corporate Auto,SUV,529.88134
4,GA49547,Washington,male,High School or Below,536307.65000,36357.00000,68.00000,1/0/00,Personal Auto,Four-Door Car,17.26932
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,male,Master,305955.03000,38644.00000,78.00000,1/1/00,Personal Auto,Four-Door Car,361.45522
1067,VJ51327,Cali,female,High School or Below,2031499.76000,63209.00000,102.00000,1/2/00,Personal Auto,SUV,207.32004
1068,GS98873,Arizona,female,Bachelor,323912.47000,16061.00000,88.00000,1/0/00,Personal Auto,Four-Door Car,633.60000
1069,CW49887,California,female,Master,462680.11000,79487.00000,114.00000,1/0/00,Special Auto,SUV,547.20000
1070,MY31220,California,female,College,899704.02000,54230.00000,112.00000,1/0/00,Personal Auto,Two-Door Car,537.60000

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

In [55]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1066    False
1067    False
1068    False
1069    False
1070    False
Length: 1071, dtype: bool

In [57]:
df.duplicated().value_counts()

False    1071
dtype: int64

In [52]:
df.drop_duplicates()

,customer,st,gender,education,customer_lifetime_value(%),income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,793690.25934,0.00000,1000.00000,1/0/00,Personal Auto,Four-Door Car,2.70493
1,QZ44356,Arizona,female,Bachelor,697953.59000,0.00000,94.00000,1/0/00,Personal Auto,Four-Door Car,1131.46493
2,AI49188,Nevada,female,Bachelor,1288743.17000,48767.00000,108.00000,1/0/00,Personal Auto,Two-Door Car,566.47225
3,WW63253,California,male,Bachelor,764586.18000,0.00000,106.00000,1/0/00,Corporate Auto,SUV,529.88134
4,GA49547,Washington,male,High School or Below,536307.65000,36357.00000,68.00000,1/0/00,Personal Auto,Four-Door Car,17.26932
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,male,Master,305955.03000,38644.00000,78.00000,1/1/00,Personal Auto,Four-Door Car,361.45522
1067,VJ51327,Cali,female,High School or Below,2031499.76000,63209.00000,102.00000,1/2/00,Personal Auto,SUV,207.32004
1068,GS98873,Arizona,female,Bachelor,323912.47000,16061.00000,88.00000,1/0/00,Personal Auto,Four-Door Car,633.60000
1069,CW49887,California,female,Master,462680.11000,79487.00000,114.00000,1/0/00,Special Auto,SUV,547.20000
1070,MY31220,California,female,College,899704.02000,54230.00000,112.00000,1/0/00,Personal Auto,Two-Door Car,537.60000

# Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [58]:
def clean_column_names(df):
    df2 = df.copy()  # Create a copy of the DataFrame
    
    # Replace white spaces with underscores and convert column names to lowercase
    df2.columns = df.columns.str.replace(' ', '_').str.lower()
    
    return df2

In [59]:
def clean_gender_values(df):
    df3 = df.copy()  # Create a copy of the DataFrame
    
    # Replace gender values based on starting letter
    df3['gender'] = df3['gender'].replace({'^[Mm].*': 'male', '^[Ff].*': 'female'}, regex=True)
    
    return df3

In [ ]:
def clean_columns_with_percentages(df, column_name):
    df4 = df.copy()  # Create a copy of the DataFrame
    
    # Remove '%' sign and convert column to float data type
    df4[column_name] = df4[column_name].str.replace('%', '').astype(float)
    
    return df4

In [ ]:
def categorical_columns(df):
    df5 = df.copy()  # Create a copy of the DataFrame
    
    # Find columns with categorical dtype
    categorical_columns = df5.select_dtypes(include=['object', 'category']).columns
    
    # Fill null values with "unknown" in categorical columns
    df5[categorical_columns] = df5[categorical_columns].fillna('unknown')
    
    return df5

In [ ]:
def numerical_columns(df):
    df6 = df.copy()  # Create a copy of the DataFrame
    
    # Find columns with numerical dtype
    numerical_columns = df6.select_dtypes(include=['int', 'float']).columns
    
    # Fill null values with mean of respective numerical columns
    df6[numerical_columns] = df6[numerical_columns].fillna(df6[numerical_columns].mean())
    
    return df6

In [61]:
def drop_null_rows(df):
    df7 = df.copy()  # Create a copy of the DataFrame
    
    # Drop rows with more than 2 null values
    df7.dropna(thresh=df7.shape[1] - 2, inplace=True)
    
    return df7

In [ ]:
def drop_duplicate_rows(df):
    df8 = df.copy()  # Create a copy of the DataFrame
    
    # Drop duplicate rows
    df8.drop_duplicates(inplace=True)
    
    return df8

In [ ]:
def clean_my_df_pandas(df):
    # Function 1: clean_column_names
    def clean_column_names(df):
        df2 = df.copy()  # Create a copy of the DataFrame
        
        # Replace white spaces with underscores and convert column names to lowercase
        df2.columns = df.columns.str.replace(' ', '_').str.lower()
        
        return df2
    
    # Function 2: clean_gender_values
    def clean_gender_values(df):
        df3 = df.copy()  # Create a copy of the DataFrame
        
        # Replace gender values based on starting letter
        df3['gender'] = df3['gender'].replace({'^[Mm].*': 'male', '^[Ff].*': 'female'}, regex=True)
        
        return df3
    
    # Function 3: clean_columns_with_percentages
    def clean_columns_with_percentages(df, column_name):
        df4 = df.copy()  # Create a copy of the DataFrame
        
        # Remove '%' sign and convert column to float data type
        df4[column_name] = df4[column_name].str.replace('%', '').astype(float)
        
        return df4
    
    # Function 4: categorical_columns
    def categorical_columns(df):
        df5 = df.copy()  # Create a copy of the DataFrame
        
        # Find columns with categorical dtype
        categorical_columns = df5.select_dtypes(include=['object', 'category']).columns
        
        # Fill null values with "unknown" in categorical columns
        df5[categorical_columns] = df5[categorical_columns].fillna('unknown')
        
        return df5
    
    # Function 5: numerical_columns
    def numerical_columns(df):
        df6 = df.copy()  # Create a copy of the DataFrame
        
        # Find columns with numerical dtype
        numerical_columns = df6.select_dtypes(include=['int', 'float']).columns
        
        # Fill null values with mean of respective numerical columns
        df6[numerical_columns] = df6[numerical_columns].fillna(df6[numerical_columns].mean())
        
        return df6
    
    # Function 6: drop_null_rows
    def drop_null_rows(df):
        df7 = df.copy()  # Create a copy of the DataFrame
        
        # Drop rows with more than 2 null values
        df7.dropna(thresh=df7.shape[1] - 2, inplace=True)
        
        return df7
    
    # Function 7: drop_duplicate_rows
    def drop_duplicate_rows(df):
        df8 = df.copy()  # Create a copy of the DataFrame
        
        # Drop duplicate rows
        df8.drop_duplicates(inplace=True)
        
        return df8
    
    # Perform the desired operations on the DataFrame
    df2 = clean_column_names(df)
    df3 = clean_gender_values(df2)
    df4 = clean_columns_with_percentages(df3, 'customer_lifetime_value(%)')
    df5 = categorical_columns(df4)
    df6 = numerical_columns(df5)
    df7 = drop_null_rows(df6)
    df8 = drop_duplicate_rows(df7)
    
    return df8

# Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [65]:
df['total_claim_amount'].quantile(0.75)

532.8

In [67]:
df['customer_lifetime_value(%)'].quantile(0.25)

404853.45999999996

In [73]:
claim_amount_threshold = df['total_claim_amount'].quantile(0.75)
lifetime_value_threshold = df['customer_lifetime_value(%)'].quantile(0.25)
filtered_df = df[(df['total_claim_amount'] > claim_amount_threshold) & (df['customer_lifetime_value(%)'] < lifetime_value_threshold)]
filtered_df[['total_claim_amount','customer_lifetime_value(%)']]

      total_claim_amount  customer_lifetime_value(%)
17             647.44203                394524.16000
23             554.37676                245019.10000
26             799.20000                394637.21000
38             648.00000                309003.41000
42             882.87194                393900.64000
62             863.32732                333976.49000
135            975.10710                402296.35000
140            721.24221                247012.12000
158            701.70824                387364.70000
160            679.36838                228759.69000
170            542.31940                241313.97000
184            792.00000                373583.81000
204            669.68200                368811.09000
250            773.47098                400151.91000
269            741.60000                359531.29000
279            641.38862                365253.24000
304            676.94402                288774.23000
388            701.70824                387364.70000
415            806.40000                372672.80000
448            845.65404                254945.00000
450            668.29397                380392.18000
467            662.40000                316765.84000
486            614.67591                357076.05000
500            842.43785                376446.51000
502           1171.93117                362345.42000
565            564.46656                368309.99000
590            537.60000                383960.61000
593            799.20000                401654.20000
638            623.22362                252395.96000
645            862.76296                309953.80000
669            541.69566                268886.40000
709            643.82672                402381.44000
788            632.71538                231973.59000
853            727.20000                354090.43000
891           1185.98830                388650.48000
908            558.09936                391936.67000
949            691.20000                289873.27000
1019           707.30342                386477.68000
1022           618.63095                366737.50000
1068           633.60000                323912.47000

In [74]:
filtered_df[['total_claim_amount','customer_lifetime_value(%)']].describe()

       total_claim_amount  customer_lifetime_value(%)
count            40.00000                    40.00000
mean            723.77658                341577.91000
std             149.28061                 56921.47203
min             537.60000                228759.69000
25%             633.37885                304220.87500
50%             685.28419                365995.37000
75%             799.20000                387364.70000
max            1185.98830                402381.44000